export const topicsData = {
	1: {
		id: 1,
		title: 'Технология обработки аудио- и видеоинформации',
		icon: '🎬',
		lessons: {
			1: {
				id: 1,
				title: 'Запись аудио- и видеоинформации',
				lessonContent: {
					fullContent: [
						{
							h2: '§ 1. Запись аудио- и видеоинформации',
							p: 'История записи звука началась в 1857 году, когда француз Эдуард Леон Скотт де Мартенвиль изобрел прибор, выцарапывавший звуковые дорожки на закопченной бумаге.',
						},
						{
							h3: '1.1. Аудио- и видеофайлы',
							p: 'Аудиоинформация (звукозапись) — звуковая информация, записанная каким-либо образом, пригодным для воспроизведения.',
						},
						{
							p: 'Звуковые колебания воздуха (звуковые сигналы) имеют форму, которую называют аналоговой. Ранее аудиоинформация в аналоговой форме записывалась в студиях, а воспроизводилась с помощью фонографов, граммофонов, патефонов, магнитофонов и электропроигрывателей.',
						},
						{
							p: 'С началом компьютерной эры звуковые сигналы начали оцифровывать, т. е. волны стали заменять наборами точечных (импульсных) сигналов, а величину импульсов — числовыми кодами. Аудиоинформация получила цифровую форму.',
						},
						{
							p: 'Аудиофайл — файл с аудиоинформацией в цифровой форме.',
						},
						{
							p: 'Видеоинформация — изображение движущихся объектов, записанное каким-либо образом, пригодным для воспроизведения.',
						},
						{
							p: 'Видеоинформация в цифровой форме является набором электронных фотографий. Видеофайл — файл с видеоинформацией и сопровождающей ее аудиоинформацией в цифровой форме.',
						},
						{
							h3: '1.2. Программные средства записи и воспроизведения',
							p: 'В смартфонах программные средства записи звука при помощи микрофона представлены диктофонами. На компьютерах с операционной системой Windows стандартной программой для записи звука является программа «Звукозапись».',
						},
						{
							p: 'Для записи видеоинформации в смартфонах широко используется приложение «Камера» в режиме записи видео. Записывать видео позволяют компьютеры с микрофоном и веб-камерой.',
						},
						{
							p: 'Программы для воспроизведения аудио- и видеофайлов называются плеерами. Медиаплееры — плееры, которые воспроизводят как звук, так и видео.',
						},
						{
							h3: '1.3. Форматы аудиофайлов',
							p: 'Формат аудиофайла — структура и особенности записи в файле цифровой аудиоинформации.',
						},
						{
							p: 'Существует более 40 форматов аудиофайлов: WAV, MP3, WMA, OGG, AAC, FLAC, MP2, MIDI. Название формата служит расширением имени файла.',
						},
						{
							p: 'Для высококачественной записи звука используется формат WAV. Формат MP3 самый распространенный и использует сжатие данных. Формат MIDI является цифровым представлением нотных записей.',
						},
						{
							h3: '1.4. Форматы видеофайлов',
							p: 'Формат видеофайла — структура и особенности записи в файле цифровой видеоинформации и сопровождающей ее аудиоинформации.',
						},
						{
							p: 'Известно более 70 форматов видеофайлов: AVI, MP4, WMV, DVD, MPEG, MOV, FLV, SWF. Для мобильных телефонов разработан формат 3GP с мощным сжатием.',
						},
						{
							p: 'Для работы с аудио- и видеофайлами используются кодеки — специальные программы, которые сжимают и восстанавливают первоначальный объем файлов.',
						},
					],
					boldText: [
						`Аудиоинформация — звуковая информация, записанная каким-либо образом, пригодным для воспроизведения.`,
						`Аудиофайл — файл с аудиоинформацией в цифровой форме.`,
						`Видеоинформация — изображение движущихся объектов, записанное каким-либо образом, пригодным для воспроизведения.`,
						`Видеофайл — файл с видеоинформацией и сопровождающей ее аудиоинформацией в цифровой форме.`,
						`Формат аудиофайла — структура и особенности записи в файле цифровой аудиоинформации.`,
						`Формат видеофайла — структура и особенности записи в файле цифровой видеоинформации.`,
						`Кодек — специальная программа, которая сжимает и восстанавливает первоначальный объем аудио- или видеофайла.`,
					],
					image: [
						`8.1.1.png`,
						`8.1.13.png`,
						`8.1.2.png`,
						`8.1.3.png`,
						`8.1.4.png`,
						`8.1.5.png`,
						`8.1.6.png`,
						`8.1.7.png`,
						`8.1.8.png`,
						`8.1.9.png`,
						`8.1.10.png`,
						`8.1.11.png`,
						`8.1.12.png`,
						
					],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
							p: '1. Что такое аудиоинформация?',
						},
						{
							p: '2. В каком виде записывается аудиоинформация в цифровой форме?',
						},
						{
							p: '3. Что такое видеоинформация?',
						},
						{
							p: '4. Что такое видеоинформация в цифровой форме?',
						},
						{
							p: '5. Как называются программы воспроизведения цифровых аудио- и видеофайлов?',
						},
						{
							p: '6. Что такое формат аудиофайла?',
						},
						{
							p: '7. Чем интересен формат аудиофайлов MIDI?',
						},
						{
							p: '8. Что такое формат видеофайла?',
						},
						{
							p: '9. Что такое кодек?',
						},
						{
							p: '10. Какие виды кодеков используются для работы с видеофайлами?',
						},
						{
							h3: 'Упражнения:',
							p: '1. Приведите примеры форматов аудиофайлов.',
						},
						{
							p: '2. Приведите примеры форматов видеофайлов.',
						},
						{
							p: '3. Откройте в смартфоне приложение «Диктофон». Произнесите и запишите определение формата видеофайла. Воспроизведите запись.',
						},
						{
							p: '4. С помощью соответствующего приложения найдите в смартфоне папку с аудиофайлами и определите их форматы.',
						},
						{
							p: '5. Откройте в смартфоне приложение «Камера». Попросите одноклассника прочитать вслух определение формата аудиофайла перед камерой. Запишите видео и воспроизведите его.',
						},
					],
				},
			},
		},
	},
}
