export const topicsData = {
	1: {
		id: 1,
		title: 'Информация и информационные процессы',
		icon: '🧠',
		lessons: {
			1: {
				id: 1,
				title: 'Информация в жизни человека',
				lessonContent: {
					fullContent: [
						{
							h2: '§ 1. Информация в жизни человека',
							p: 'Каждый из нас не раз слышал слово «информация». Информацию мы получаем из книг и газет, из Интернета, от людей, с которыми общаемся.',
						},
						{
							h3: '1.1. Виды информации',
							p: 'Информация — сведения о предметах, событиях, явлениях и процессах окружающего мира.',
						},
						{
							p: 'Большая часть сведений, на основании которых формируется представление человека о мире, поступает к нему благодаря органам чувств. В зависимости от того, с помощью каких органов чувств информация поступила к человеку, ее классифицируют по способу восприятия:',
						},
						{
							p: '- **Визуальная информация** воспринимается органами зрения (глазами), различающими форму, объем, цвет, перемещение и изменение объектов.',
						},
						{
							p: '- Органы слуха (уши) воспринимают **звуковую информацию**. С их помощью можно распознавать звуки, различать их тембр, высоту, ритм.',
						},
						{
							p: '- **Тактильная информация** связана с органами осязания, позволяющими на ощупь определить характер поверхности, ее температуру, почувствовать прикосновение.',
						},
						{
							p: '- С помощью органов вкуса человек получает **вкусовую информацию** о пище: горькая, сладкая, кислая, соленая.',
						},
						{
							p: '- Орган обоняния (нос) воспринимает и распознает **информацию** о запахах.',
						},
						{
							p: 'Существует также классификация информации по форме представления:',
						},
						{
							p: '- **Графическая информация** — сведения в виде рисунков, схем, фотографий.',
						},
						{
							p: '- **Текстовая информация** — сведения в виде специальных символов (букв различных алфавитов; иероглифов, с помощью которых записывают отдельные слоги или слова).',
						},
						{
							p: '- **Числовая (цифровая) информация** — сведения, отражающие количественную меру объектов и их свойств с помощью чисел и цифр.',
						},
						{
							p: '- **Звуковая информация** — сведения в виде звуков.',
						},
						{
							p: 'Существуют и комбинированные виды информации — видеоинформация и мультимедийная информация.',
						},
						{
							p: 'Помимо классификации информации по способу восприятия и по форме представления, существуют также и другие классификации. По сфере возникновения информацию можно разделить на следующие группы:',
						},
						{
							p: '- **Механическая** — отражает процессы и явления неодушевленной природы.',
						},
						{
							p: '- **Биологическая** — связана с процессами животного и растительного мира.',
						},
						{
							p: '- **Социальная** — отражает процессы человеческого общества.',
						},
					],
					boldText: [
						'Информация — сведения о предметах, событиях, явлениях и процессах окружающего мира.',
						'Визуальная информация воспринимается органами зрения.',
						'Звуковая информация воспринимается органами слуха.',
						'Тактильная информация воспринимается органами осязания.',
					],
					image: [
						'7.1.1.png',
						'7.1.png',
						'7.1.2.png',
						'7.1.3.png',
						'7.1.4.png',
						'7.1.5.png',
						'7.1.6.png',
						'7.1.7.png',
						'7.1.8.png',
						'7.1.9.png',
						'7.1.10.png',
						'7.1.11.png',
					],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
						},
						{
							p: '1. Что понимается под информацией?',
						},
						{
							p: '2. Как можно классифицировать информацию по способу ее восприятия человеком?',
						},
						{
							p: '3. На какие виды разделяют информацию по форме представления?',
						},
						{
							p: '4. Какие существуют классификации информации по сфере возникновения?',
						},
						{
							h3: 'Упражнения:',
						},
						{
							p: '1. Приведите примеры различных видов информации по способу восприятия.',
						},
						{
							p: '2. Опишите ситуации, в которых информация представлена в разных формах.',
						},
						{
							p: '3. Подготовьте сообщение на одну из тем:',
						},
						{
							p: '   - «Древние носители информации»',
						},
						{
							p: '   - «Электронные носители информации»',
						},
						{
							p: '   - «Дополненная реальность как форма представления информации»',
						},
					],
				},
			},
			2: {
				id: 2,
				title: 'Представление информации в компьютере',
				lessonContent: {
					fullContent: [
						{
							h2: '§ 2. Представление информации в компьютере',
						},
						{
							p: 'Кодирование информации использовалось с древности. Широко известен шифр Юлия Цезаря, применявшийся для записи секретных сообщений. Каждый символ в тексте заменялся символом, находящимся на некотором постоянном расстоянии левее или правее его в алфавите.',
						},
						{
							p: 'Например, при кодировании информации с помощью букв русского алфавита путем сдвига вправо на 3 буква «А» была бы заменена на «Г», буква «В» станет «Д» и т. д.',
						},
						{
							h3: '2.1. Кодирование информации',
						},
						{
							p: 'Для общения люди используют естественный язык, например белорусский или русский. В основе естественного языка лежит алфавит — система графических знаков для передачи звуков устной речи. Алфавит естественного языка является универсальным кодом любой письменной культуры.',
						},
						{
							p: 'Кроме естественных, человек использует искусственно созданные языки со своими особыми кодами: язык математических или химических формул, ноты и др.',
						},
						{
							p: '**Код** — совокупность условных знаков, каждому из которых присваивается определенное значение.',
						},
						{
							p: 'Процесс записи или преобразования информации в соответствии с правилами, заданными некоторым кодом, называют **кодированием**. Процесс, обратный кодированию, называют **декодированием**.',
						},
						{
							p: 'Кодировать и передавать информацию можно различными способами: устно, письменно, жестами и др. Компьютер может обрабатывать числовую, текстовую, графическую и звуковую информацию только в цифровом формате, который в компьютере представлен в виде двоичного кода.',
						},
						{
							p: 'Двоичный код — способ кодирования, в котором каждый разряд принимает одно из двух возможных значений, обычно обозначаемых цифрами 0 и 1. Разряд в этом случае называется двоичным разрядом.',
						},
						{
							p: 'Такой способ кодирования связан с тем, что проще всего реализуются технические устройства, обладающие двумя устойчивыми состояниями: включено/выключено, соединено/разъединено и др.',
						},
						{
							p: 'Для кодирования числовой информации в компьютере вместо десятичной системы счисления используется двоичная, основанная на двоичном коде.',
						},
						{
							p: 'Кодирование текстовой информации в компьютере выполняется при помощи специальных кодовых таблиц, где каждому символу ставится в соответствие определенная последовательность из нулей и единиц.',
						},
						{
							h3: '2.2. Единицы измерения объема информации',
						},
						{
							p: 'Человек применяет различные единицы измерения. Так, для измерения времени используются секунды, минуты, часы, для измерения расстояния — метры, километры и др.',
						},
						{
							p: 'Для определения количества информации есть свои единицы измерения. Минимальное количество информации, для кодирования которой достаточно одного двоичного разряда, называют **битом** (bit).',
						},
						{
							p: 'Слово «бит» произошло от английских слов binary (двоичный) и digit (знак). Бит — минимальная единица, выражающая количество информации. Он может принимать одно из двух значений — 0 или 1. Для удобства введена более крупная единица измерения информации — байт.',
						},
						{
							p: '**Байт** — единица измерения количества информации, состоящая из восьми последовательных и взаимосвязанных битов.',
						},
						{
							p: '1 байт = 8 бит',
						},
						{
							p: 'Для обозначения большего объема информации используются другие единицы измерения:',
						},
						{
							ul: [
								'1 Кбайт (килобайт) = 1024 байта',
								'1 Мбайт (мегабайт) = 1 048 576 байт',
								'1 Гбайт (гигабайт) = 1 073 741 824 байта',
								'1 Тбайт (терабайт) = 1 099 511 627 776 байт',
							],
						},
						{
							p: 'Значения данных единиц измерения информации для удобства кодирования связаны со степенью числа 2.',
						},
					],
					boldText: [
						'Код — совокупность условных знаков, каждому из которых присваивается определенное значение',
						'Кодирование — процесс записи или преобразования информации в соответствии с правилами кода',
						'Декодирование — процесс, обратный кодированию',
						'Двоичный код — способ кодирования с использованием двух значений: 0 и 1',
						'Бит — минимальная единица измерения информации',
						'Байт — единица измерения информации, состоящая из 8 битов',
					],
					image: ['7.2.1.png', '7.2.2.png', '7.2.3.png'],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
						},
						{
							p: '1. Что такое код?',
						},
						{
							p: '2. Какой процесс называют кодированием информации?',
						},
						{
							p: '3. Какой код используют для кодирования информации в компьютере?',
						},
						{
							p: '4. Какие единицы измерения информации вы знаете?',
						},
						{
							h3: 'Упражнения:',
						},
						{
							p: '1. Используя шифр Юлия Цезаря со сдвигом вправо на 3, закодируйте фразу «Кто владеет информацией, тот владеет миром».',
						},
						{
							p: '2. Используя шифр Юлия Цезаря со сдвигом влево на 2, закодируйте фразу Стива Джобса «Компьютер — это как велосипед для нашего мозга».',
						},
						{
							p: '3. Выполните перевод единиц измерения информации:',
						},
						{
							ul: [
								'174 байта в биты',
								'342,3 Кбайт в байты',
								'45 638 Мбайт в гигабайты',
							],
						},
					],
				},
			},
		},
	},
}
