export const topicsData = {
	1: {
		id: 1,
		title: 'Информация и информационные процессы',
		icon: '🧠',
		lessons: {
			1: {
				id: 1,
				title: 'Информация в жизни человека',
				lessonContent: {
					fullContent: [
						{
							h2: '§ 1. Информация в жизни человека',
							p: 'Каждый из нас не раз слышал слово «информация». Информацию мы получаем из книг и газет, из Интернета, от людей, с которыми общаемся.',
						},
						{
							h3: '1.1. Виды информации',
							p: 'Информация — сведения о предметах, событиях, явлениях и процессах окружающего мира.',
						},
						{
							p: 'Большая часть сведений, на основании которых формируется представление человека о мире, поступает к нему благодаря органам чувств. В зависимости от того, с помощью каких органов чувств информация поступила к человеку, ее классифицируют по способу восприятия:',
						},
						{
							p: '- **Визуальная информация** воспринимается органами зрения (глазами), различающими форму, объем, цвет, перемещение и изменение объектов.',
						},
						{
							p: '- Органы слуха (уши) воспринимают **звуковую информацию**. С их помощью можно распознавать звуки, различать их тембр, высоту, ритм.',
						},
						{
							p: '- **Тактильная информация** связана с органами осязания, позволяющими на ощупь определить характер поверхности, ее температуру, почувствовать прикосновение.',
						},
						{
							p: '- С помощью органов вкуса человек получает **вкусовую информацию** о пище: горькая, сладкая, кислая, соленая.',
						},
						{
							p: '- Орган обоняния (нос) воспринимает и распознает **информацию** о запахах.',
						},
						{
							p: 'Существует также классификация информации по форме представления:',
						},
						{
							p: '- **Графическая информация** — сведения в виде рисунков, схем, фотографий.',
						},
						{
							p: '- **Текстовая информация** — сведения в виде специальных символов (букв различных алфавитов; иероглифов, с помощью которых записывают отдельные слоги или слова).',
						},
						{
							p: '- **Числовая (цифровая) информация** — сведения, отражающие количественную меру объектов и их свойств с помощью чисел и цифр.',
						},
						{
							p: '- **Звуковая информация** — сведения в виде звуков.',
						},
						{
							p: 'Существуют и комбинированные виды информации — видеоинформация и мультимедийная информация.',
						},
						{
							p: 'Помимо классификации информации по способу восприятия и по форме представления, существуют также и другие классификации. По сфере возникновения информацию можно разделить на следующие группы:',
						},
						{
							p: '- **Механическая** — отражает процессы и явления неодушевленной природы.',
						},
						{
							p: '- **Биологическая** — связана с процессами животного и растительного мира.',
						},
						{
							p: '- **Социальная** — отражает процессы человеческого общества.',
						},
					],
					boldText: [
						`Информация — сведения о предметах, событиях, явлениях и процессах окружающего мира.`,
						`Визуальная информация воспринимается органами зрения.`,
						`Звуковая информация воспринимается органами слуха.`,
						`Тактильная информация воспринимается органами осязания.`,
					],
					image: [
						`7.1.1.png`,
						`7.1.png`,
						`7.1.2.png`,
						`7.1.3.png`,
						`7.1.4.png`,
						`7.1.5.png`,
						`7.1.6.png`,
						`7.1.7.png`,
						`7.1.8.png`,
						`7.1.9.png`,
						`7.1.10.png`,
						`7.1.11.png`,
					],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
							p: '1. Что понимается под информацией?',
						},
						{
							p: '2. Как можно классифицировать информацию по способу ее восприятия человеком?',
						},
						{
							p: '3. На какие виды разделяют информацию по форме представления?',
						},
						{
							p: '4. Какие существуют классификации информации по сфере возникновения?',
						},
						{
							h3: 'Упражнения:',
							p: '1. Приведите примеры различных видов информации по способу восприятия.',
						},
						{
							p: '2. Опишите ситуации, в которых информация представлена в разных формах.',
						},
						{
							p: '3. Подготовьте сообщение на одну из тем:',
						},
						{
							p: '   - «Древние носители информации»',
						},
						{
							p: '   - «Электронные носители информации»',
						},
						{
							p: '   - «Дополненная реальность как форма представления информации»',
						},
					],
				},
			},
			2: {
				id: 2,
				title: 'Носители информации и информационные процессы',
				lessonContent: {
					fullContent: [
						{
							h3: '1.2. Носители информации',
							p: 'Для записи, хранения и считывания информации используются носители информации. В древности человек сохранял важные сведения лишь в собственной памяти, т. е. память человека является естественным носителем информации.',
						},
						{
							p: 'К носителям информации относятся бумага, книга, фотография, оптические диски, флеш-память и др. Для обработки, хранения и распространения информации строят специальные здания — датацентры.',
						},
						{
							h3: '1.3. Информационные процессы',
							p: 'Любая деятельность человека, связанная с информацией, является **информационным процессом**. Различают следующие информационные процессы: **хранение, передача, обработка**, поиск информации.',
						},
						{
							p: 'Люди хранят информацию либо в собственной памяти, либо на каких-либо внешних носителях. Иногда человек забывает информацию, а информация на внешних носителях может храниться долго и быть доступна разным людям.',
						},
						{
							p: 'Передача информации происходит, к примеру, при разговоре двух людей, при чтении книги или журнала, при просмотре страниц в сети Интернет и др.',
						},
						{
							p: 'В процессе передачи всегда участвуют две стороны: источник и приемник. Передача информации происходит через канал связи: звуковые волны при непосредственном разговоре, услуги почтового сервиса при переписке, сотовая связь при разговоре по мобильному телефону.',
						},
						{
							p: 'В результате изменения содержания или формы представления информации происходит ее обработка.',
						},
						{
							p: 'Содержание информации может измениться в результате вычислительных действий, допустим, при решении любой математической задачи, уравнения. Процесс рассуждений человека также может приводить к появлению новой информации.',
						},
						{
							p: 'Форма представления информации изменяется при рисовании картин по текстовому описанию или при описании сюжета видеофильма в виде статьи в журнале, при переводе текста с одного языка на другой и т. д.',
						},
						{
							p: 'Если человеку необходимо найти интересующие его сведения, то он осуществляет поиск информации. Для поиска нужной информации используются разнообразные способы и методы: чтение энциклопедий, словарей, книг и журналов, просмотр видеофильмов и телевизионных передач, поиск в сети Интернет и т. д.',
						},
					],
					boldText: [
						`Носитель информации — материальный объект, используемый для записи, хранения и передачи информации.`,
						`Информационный процесс — деятельность человека, связанная с информацией.`,
						`Основные информационные процессы: хранение, передача, обработка, поиск информации.`,
					],
					image: [
						`7.1.png`,
						`7.1.1.png`,
						`7.1.2.png`,
						`7.1.3.png`,
						`7.1.4.png`,
						`7.1.5.png`,
						`7.1.6.png`,
						`7.1.7.png`,
						`7.1.8.png`,
						`7.1.9.png`,
						`7.1.10.png`,
						`7.1.11.png`,
					],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
							p: '1. Что такое носитель информации?',
						},
						{
							p: '2. Какие информационные процессы выполняет человек?',
						},
						{
							p: '3. Что происходит при обработке информации?',
						},
						{
							p: '4. Как осуществляется передача информации?',
						},
						{
							h3: 'Упражнения:',
							p: '1. Какие информационные процессы выполняет семиклассник при следующих видах деятельности?',
						},
						{
							p: '   - Запись в конспект материалов урока.',
						},
						{
							p: '   - Устный ответ у доски.',
						},
						{
							p: '   - Перевод текста с русского языка на английский.',
						},
						{
							p: '   - Подбор материалов для реферата по истории.',
						},
						{
							p: '2. Приведите примеры профессий, в которых основная деятельность специалиста связана с информацией.',
						},
						{
							p: '3. Опишите ситуации, в которых вы можете играть роль источника информации; приемника информации. Каким каналом связи вы пользуетесь при этом?',
						},
					],
				},
			},
		},
	},
	2: {
		id: 2,
		title: 'Представление о логике высказываний. Множества и операции над ними',
		icon: '📊',
		lessons: {
			1: {
				id: 1,
				title: 'Логика высказываний',
				lessonContent: {
					fullContent: [
						{
							h2: 'Логика высказываний',
							p: 'Содержание урока по логике высказываний...',
						},
					],
					boldText: [`Логика — наука о формах и законах правильного мышления.`],
					image: [],
					exercises: [],
				},
			},
		},
	},
}
