export const topicsData = {
	1: {
		id: 1,
		title: 'Информация и информатика',
		icon: '📊',
		lessons: {
			1: {
				id: 1,
				title: 'Информация и данные',
				lessonContent: {
					fullContent: [
						{
							h2: 'Информационные революции',
							p: 'Каждая из пяти информационных революций связана с кардинальными изменениями в сфере обработки информации.',
						},
						{
							p: '1. Первая информационная революция: связана с развитием языка и речи.',
						},
						{
							p: '2. Вторая информационная революция: обусловлена появлением письменности (около 5 тыс. лет назад).',
						},
						{
							p: '3. Третья информационная революция: связана с изобретением книгопечатания в Европе (XV в.).',
						},
						{
							p: '4. Четвертая информационная революция: связана с появлением коммуникационных средств: радио, телеграфа, телефона, телевидения (конец XIX — начало XX в.).',
						},
						{
							p: '5. Пятая информационная революция: началась в 50-х гг. XX в. в связи с появлением цифровой вычислительной техники.',
						},
						{
							h2: '1.1. Понятие об информации',
							p: 'Слово информация произошло от латинского слова informatio — разъяснение, изложение, осведомление, истолкование. Точного научного определения понятия информация пока нет.',
						},
						{
							p: 'Информация — сведения об объектах и событиях окружающего мира. Если полученные сведения являются новыми и понятными для человека, то он пополняет свои знания.',
						},
						{
							h3: 'Свойства информации:',
							p: '- Полнота — информация должна всесторонне отражать сведения о предмете или явлении;',
						},
						{
							p: '- Актуальность — информация должна быть важной и необходимой в текущий момент времени;',
						},
						{
							p: '- Достоверность — информация должна отражать только верные сведения;',
						},
						{
							p: '- Ясность — информация должна быть представлена в форме, доступной для восприятия.',
						},
						{
							p: 'Информация, обладающая этими свойствами, помогает человеку принимать правильные решения в конкретной ситуации.',
						},
						{
							h2: '1.2. Данные',
							p: 'Человек может сохранять информацию для дальнейшего использования, передавать различные сведения другим людям. Если сведения представляют собой записи в удобном и понятном виде, то человек может извлечь из них информацию.',
						},
						{
							p: 'Чаще всего человек делает записи на естественном языке (русский, белорусский, английский и др.). Кроме естественного, могут использовать и формальные языки: математическая символика, нотная грамота, шрифт Брайля и др.',
						},
						{
							p: 'Данные — сведения, представленные на одном из формальных языков (в формализованном виде).',
						},
						{
							p: 'Человек может воспринимать информацию как на естественном языке, так и на формальном. Данные, с которыми работает техническое устройство, должны быть представлены в формализованном виде.',
						},
						{
							p: 'И человек, и техническое устройство могут преобразовывать данные из одного представления в другое. Из данных можно извлечь информацию. Например, текст в учебнике — это данные. Учащийся, читающий этот текст, извлекает из него информацию.',
						},
						{
							p: 'Для извлечения информации из данных на компьютере необходимо создать специальные программы, которые позволяют преобразовать данные к виду, понятному человеку. Представление информации в формализованном виде позволяет автоматизировать ее сбор, передачу, хранение и дальнейшую обработку на компьютере.',
						},
						{
							h2: '1.3. Информатика как научная область',
							p: 'Термин информатика (франц. informatique) возник в 40-х гг. XX в. во Франции. Он происходит от французских слов information (информация) и automatic (автоматика) и дословно означает «информационная автоматика», или «автоматизированная обработка информации».',
						},
						{
							p: 'В англоязычных странах вместо термина информатика часто используют термин computer science (компьютерная наука).',
						},
						{
							p: 'Развитие компьютерных информационных технологий основывается на трех составляющих:',
						},
						{
							p: '- Аппаратное обеспечение (Hardware) — компьютер и другие устройства для работы с данными;',
						},
						{
							p: '- Программное обеспечение (Software) — набор программ для преобразования и обработки данных;',
						},
						{
							p: '- Алгоритмическое обеспечение (Brainware) — алгоритмы обработки данных, а также приемы и методы для разработки таких алгоритмов.',
						},
						{
							p: 'Информатика — наука, изучающая методы создания, представления, хранения, передачи, обработки и использования информации с применением компьютерных технологий в различных сферах деятельности человека.',
						},
						{
							p: 'Информатика включает разные дисциплины: теория информации, теория вычислений, теория алгоритмов, программирование, устройство компьютера, информационные технологии.',
						},
						{
							p: 'Относительно молодой областью информатики является искусственный интеллект (ИИ).',
						},
					],
					boldText: [
						`Информация — сведения об объектах и событиях окружающего мира.`,
						`Данные — сведения, представленные на одном из формальных языков (в формализованном виде).`,
						`Информатика — наука, изучающая методы создания, представления, хранения, передачи, обработки и использования информации с применением компьютерных технологий в различных сферах деятельности человека.`,
						`Компьютерные технологии — это технологи работы с данными, основанные на применении компьютеров.`,
					],
					image: [
						`6.1.1.png`,
						`6.1.2.png`,
						`6.1.3.png`,
						`6.1.4.png`,
						`6.1.5.png`,
						`6.1.6.png`,
						`6.1.7.png`,
					],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
							p: '1. Что понимают под термином информация?',
						},
						{
							p: '2. Какими свойствами обладает информация?',
						},
						{
							p: '3. Как могут быть представлены данные, которые воспринимает человек?',
						},
						{
							p: '4. В чем отличие понятий информация и данные?',
						},
						{
							p: '5. Что изучает информатика?',
						},
						{
							p: '6. Какие дисциплины включает в себя информатика?',
						},
						{
							h3: 'Упражнение 1:',
							p: 'В каком видe представлены следующие данные?',
						},
						{
							p: '1. Звонок на урок.',
						},
						{
							p: '2. Картина в музее.',
						},
						{
							p: '3. Рассказ в книге.',
						},
						{
							p: '4. Объяснение материала учителем.',
						},
						{
							p: '5. Рекламный видеоролик.',
						},
						{
							p: '6. Штрихкод на упаковке товара в магазине.',
						},
						{
							h3: 'Упражнение 2:',
							p: 'Приведите пример данных, представленных на формальных языках.',
						},
						{
							h3: 'Упражнение 3:',
							p: 'Маша включила телевизор и услышала прогноз погоды на завтра. Какими свойствами обладает полученная Машей информация для каждого из нижеперечисленных случаев?',
						},
						{
							p: '1. Демонстрировали художественный фильм, а Маша попала на эпизод, в котором прогноз погоды слушал главный герой.',
						},
						{
							p: '2. Передавали программу новостей на японском языке, которого Маша не знает.',
						},
						{
							p: '3. Шла программа новостей регионального телевидения.',
						},
						{
							p: '4. Показывали исторический очерк о событиях 1978 г.',
						},
						{
							h3: 'Упражнение 4:',
							p: 'Приведите пример представления одного и того же сообщения разными способами.',
						},
						{
							h3: 'Упражнение 5:',
							p: 'Определите, в каком виде представлены данные.',
						},
						{
							p: '1. Дорожные знаки, указывающие направление движения.',
						},
						{
							p: '2. Пение канарейки.',
						},
						{
							p: '3. Школьная историческая карта.',
						},
						{
							h3: 'Подготовьте сообщение на одну из тем:',
							p: '1. Искусственный интеллект.',
						},
						{
							p: '2. «Умные» гаджеты.',
						},
						{
							p: '3. Робототехника.',
						},
						{
							p: '4. Кибернетика.',
						},
					],
				},
			},
			2: {
				id: 2,
				title: 'Технические средства для работы с информацией',
				lessonContent: {
					fullContent: [
						{
							h2: '2.1. Современные устройства для работы с информацией',
							p: 'Одним из самых распространенных устройств для работы с данными является компьютер. Компьютер может получать данные с другого устройства или от человека, хранить и обрабатывать данные, передавать данные другому устройству или человеку.',
						},
						{
							p: 'Компьютер — универсальное устройство для работы с данными.',
						},
						{
							p: 'Сегодня компьютеры можно встретить практически в любой сфере деятельности. Они являются незаменимыми помощниками человека в науке, инженерных расчетах, на производстве. С помощью компьютеров создают анимационные фильмы и музыкальные произведения. Компьютеры находят применение в быту и сфере услуг.',
						},
						{
							p: 'Компьютеры хранят данные о книгах в библиотеке и о лекарствах в аптеке. Литературные и музыкальные произведения, театральные постановки и концерты любимых артистов можно хранить на компьютере в электронном виде.',
						},
						{
							p: 'Кроме компьютеров с данными могут работать и другие устройства. К ним можно отнести цифровые фотоаппараты и видеокамеры, смартфоны и планшеты, навигаторы, платежные терминалы и др. Все эти устройства позволяют пользователю вводить данные, обрабатывать запрос, выводить результат, сохранять или передавать информацию.',
						},
						{
							p: 'В современную бытовую технику (стиральные и посудомоечные машины, мультиварки, СВЧ-печи, пылесосы и др.) часто встраивают компьютеры, которые обеспечивают работу прибора в режиме, соответствующем запросу пользователя.',
						},
						{
							p: 'Компьютерные устройства используются в системах управления судами и самолетами, станках с программным управлением, медицинском оборудовании и т. д.',
						},
						{
							h2: '2.2. Правила работы и безопасного поведения в компьютерном классе',
							p: 'Изучение информатики происходит в кабинетах, оборудованных компьютерной техникой, требующей бережного обращения. Такая техника подключена к электрической сети с напряжением, опасным для жизни человека.',
						},
						{
							p: 'Для сохранения здоровья и поддержания техники в рабочем состоянии необходимо строго соблюдать правила работы и безопасного поведения в компьютерном классе:',
						},
						{
							p: '1. Занимать рабочее место за компьютером можно только после разрешения учителя.',
						},
						{
							p: '2. Работать за компьютером можно только чистыми руками.',
						},
						{
							p: '3. Перед началом работы с компьютером необходимо убедиться в отсутствии видимых повреждений рабочего места.',
						},
						{
							p: '4. Категорически запрещается:',
						},
						{
							p: '   - прикасаться к проводам и соединительным кабелям, экрану и тыльной стороне монитора;',
						},
						{
							p: '   - класть на монитор, клавиатуру и системный блок книги, тетради и другие предметы;',
						},
						{
							p: '   - самостоятельно устранять любые неисправности в работе техники.',
						},
						{
							p: '5. Сидеть нужно прямо, не сутулясь, не наклоняясь близко к поверхности экрана (расстояние от глаз до экрана должно составлять 50–70 см).',
						},
						{
							p: '6. Для учащихся 5–7-х классов время работы за компьютером на уроке не должно превышать 20–25 мин.',
						},
						{
							p: '7. После 10–15 мин работы нужно выполнить упражнения для снятия усталости глаз и мышечного напряжения.',
						},
						{
							p: '8. Обо всех недостатках, обнаруженных во время работы за компьютером, следует сразу же сообщать учителю.',
						},
						{
							p: '9. Нельзя работать за компьютером при плохом самочувствии. Если на уроке появились симптомы недомогания, следует обратиться за помощью к учителю.',
						},
						{
							p: '10. В конце урока рабочее место за компьютером должно остаться чистым и аккуратным. Необходимо закрыть все программы, собрать свои вещи и привести рабочее место в порядок.',
						},
					],
					boldText: [
						`Компьютер — универсальное устройство для работы с данными.`,
						`Для сохранения здоровья и поддержания техники в рабочем состоянии необходимо строго соблюдать правила работы и безопасного поведения в компьютерном классе.`,
					],
					image: [
							`6.2.1.png`,
							`6.2.2.png`,
							`6.2.3.png`,
							`6.2.4.png`,
							`6.2.5.png`,
							`6.2.6.png`,
							`6.2.7.png`,
							`6.2.8.png`,
							`6.2.9.png`,
							
						],
					exercises: [
						{
							h3: 'Вопросы для самоконтроля:',
							p: '1. В каких сферах и для чего используется компьютер?',
						},
						{
							p: '2. Какие устройства для работы с данными вы можете назвать?',
						},
						{
							p: '3. В каких бытовых приборах реализована возможность выбора режимов работы с помощью встроенных компьютеров?',
						},
						{
							p: '4. Что запрещено делать в кабинете информатики?',
						},
						{
							p: '5. Как правильно сидеть за компьютером?',
						},
						{
							p: '6. Какова продолжительность непрерывной работы за компьютером для учащихся 6-го класса?',
						},
						{
							h3: 'Упражнения:',
							p: '1. Подготовьте сообщение об использовании компьютера в одной из сфер:',
						},
						{
							p: '   - Образование',
						},
						{
							p: '   - Торговля',
						},
						{
							p: '   - Кинопроизводство',
						},
						{
							p: '2. Подготовьте сообщение о назначении какого-либо устройства для работы с данными.',
						},
						{
							p: '3. Разгадайте ребусы.',
						},
						{
							p: '4. Какие правила поведения в компьютерном классе нарушены?',
						},
					],
				},
			},
		},
	},
	2: {
		id: 2,
		title: 'Вторая тема',
		icon: '💻',
		lessons: {
			1: {
				id: 1,
				title: 'Урок второй темы',
				lessonContent: {
					// контент урока
				},
			},
		},
	},
}
