export const classData = {
	6: {
		title: '6 класс',
		icon: '🧠',
		color: '#4facfe',
		topics: [
			{
				id: 1,
				title: 'ИНФОРМАЦИЯ И ИНФОРМАТИКА',
				description: `Понятие об информации и ее роли в обществе, о данных, об информатике как науке.`,
				icon: '📊',
				lessons: 2,
				duration: '2 часа',
				path: '/courses/forschool/6/topic/1',
			},
			{
				id: 2,
				title: 'ОСНОВЫ РАБОТЫ С КОМПЬЮТЕРОМ',
				description:
					'Узнаем о функциональных блоках компьютера и их назначении. А также узнаем много нового о ПК',
				icon: '💻',
				lessons: 2,
				duration: '2 часа',
				path: '/courses/forschool/6/topic/2',
			},
			{
				id: 3,
				title: 'ОБРАБОТКА РАСТРОВЫХ ИЗОБРАЖЕНИЙ',
				description:
					'Узнаем о растровых изображениях, их создании и редактировании, а также об операциях над фрагментами изображений',
				icon: '🎨',
				lessons: 4,
				duration: '5 часов',
				path: '/courses/forschool/6/topic/3',
			},
			{
				id: 4,
				title: 'СОЗДАНИЕ ТЕКСТОВЫХ ДОКУМЕНТОВ',
				description:
					'Узнаем что такое текстовый документ, узнаем о назначении текстового редактора, узнаем про операции над текстом',
				icon: '📝',
				lessons: 3,
				duration: '5 часов',
				path: '/courses/forschool/6/topic/4',
			},
			{
				id: 5,
				title: 'КОМПЬЮТЕРНЫЕ ПРЕЗЕНТАЦИИ',
				description:
					'Узнаем все о компьютерных презентациях и научимся создавать собственные, научимся работать с элементами мультимедии',
				icon: '🎨',
				lessons: 4,
				duration: '8 часов',
				path: '/courses/forschool/6/topic/5',
			},
			{
				id: 6,
				title: 'АЛГОРИТМЫ И ИСПОЛНИТЕЛИ',
				description:
					'Узнаем об алгоритме и исполнителе. Узнаем о способах записи алгоритмов, узнаем о среде программирования, и будем составлять свои программы',
				icon: '💻',
				lessons: 5,
				duration: '8 часов',
				path: 'https://it-course-k.vercel.app/',
			},
			{
				id: 7,
				title: 'ИНТЕРНЕТ. ЭЛЕКТРОННАЯ ПОЧТА',
				description:
					'Узнаем о сети интернет, WWW(World Wide Web), научимся работать с электронной почтой и в сети интернет',
				icon: '🌐',
				lessons: 3,
				duration: '3 часа',
				path: '/courses/forschool/6/topic/7',
			},
		],
		tests: [
      {
        id: 1,
        title: 'ИНФОРМАЦИЯ И ИНФОРМАТИКА',
        description: '6 КЛАСС. ТЕСТ №1',
        icon: '📝',
        questions: 10,
        duration: '25 минут',
        path: '/courses/forschool/6/test/1'
      },
      {
        id: 2,
        title: 'СТРУКТУРА КОМПЬЮТЕРА',
        description: '6 КЛАСС. ТЕСТ №2',
        icon: '💻',
        questions: 10,
        duration: '25 минут',
        path: '/courses/forschool/6/test/2'
      },
    ]
	},
	7: {
		title: '7 класс',
		icon: '💻',
		color: '#00f2fe',
		topics: [
			{
				id: 1,
				title: 'ИНФОРМАЦИЯ И ИНФОРМАЦИОННЫЕ ПРОЦЕССЫ',
				description:
					'Изучение роли информации в жизни человека и способов представления информации в компьютере',
				icon: '🗃️',
				lessons: 2,
				duration: '2 часа',
				path: '/courses/forschool/7/topic/1',
			},
			{
				id: 2,
				title: 'ЛОГИКА ВЫСКАЗЫВАНИЙ И МНОЖЕСТВА',
				description:
					'Изучение основ логики высказываний, теории множеств и их применения в информатике',
				icon: '📊',
				lessons: 4,
				duration: '6 часов',
				path: '/courses/forschool/7/topic/2',
			},
			{
				id: 3,
				title: 'ОСНОВНЫЕ АЛГОРИТМИЧЕСКИЕ КОНСТРУКЦИИ',
				description:
					'Изучение алгоритмов, исполнителей и основных алгоритмических конструкций на примере языка Паскаль',
				icon: '🧩',
				lessons: 6,
				duration: '12 часов',
				path: '/courses/forschool/7/topic/3',
			},
			{
				id: 4,
				title: 'АППАРАТНОЕ И ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ',
				description:
					'Изучение современных компьютерных устройств, операционных систем и программного обеспечения',
				icon: '💻',
				lessons: 5,
				duration: '8 часов',
				path: '/courses/forschool/7/topic/4',
			},
			{
				id: 5,
				title: 'РАБОТА С ВЕКТОРНОЙ ГРАфИКОЙ',
				description:
					'Изучение основ векторной графики и работа в графическом редакторе Inkscape',
				icon: '🎨',
				lessons: 5,
				duration: '10 часов',
				path: '/courses/forschool/7/topic/5',
			},
		],
	},
	8: {
		title: '8 класс',
		icon: '🚀',
		color: 'gold',
		topics: [
			{
				id: 1,
				title: 'ТЕХНОЛОГИЯ ОБРАБОТКИ АУДИО- И ВИДЕОИНФОРМАЦИИ',
				description:
					'Изучение форматов аудио и видеофайлов, основ записи и редактирования мультимедийного контента',
				icon: '🎬',
				lessons: 8,
				duration: '12 часов',
				path: '/courses/forschool/8/topic/1',
			},
			{
				id: 2,
				title: 'ОСНОВЫ АНИМАЦИИ',
				description:
					'Изучение принципов создания анимации, работы с редактором Flash и различными видами анимации',
				icon: '✨',
				lessons: 9,
				duration: '14 часов',
				path: '/courses/forschool/8/topic/2',
			},
			{
				id: 3,
				title: 'ОСНОВЫ АЛГОРИТМИЗАЦИИ И ПРОГРАММИРОВАНИЯ',
				description:
					'Изучение алгоритмических конструкций, графических возможностей PascalABC и решение практических задач',
				icon: '💻',
				lessons: 7,
				duration: '16 часов',
				path: '/courses/forschool/8/topic/3',
			},
			{
				id: 4,
				title: 'ТЕХНОЛОГИЯ ОБРАБОТКИ ТЕКСТОВЫХ ДОКУМЕНТОВ',
				description:
					'Изучение продвинутых возможностей текстовых редакторов: стили, таблицы, формулы и графические объекты',
				icon: '📝',
				lessons: 7,
				duration: '12 часов',
				path: '/courses/forschool/8/topic/4',
			},
		],
	},
	9: {
		title: '9 класс',
		icon: '🌐',
		color: 'red',
		topics: [
			{
				id: 1,
				title: 'ИНФОРМАЦИОННЫЕ РЕСУРСЫ ИНТЕРНЕТА',
				description: 'Изучение массивов, списков, стеков, очередей и деревьев',
				icon: '🌐',
				lessons: 3,
				duration: '5 часов',
				path: '/courses/forschool/9/topic/1',
			},
			{
				id: 2,
				title: 'АЛГОРИТМЫ ОБРАБОТКИ СТРОКОВЫХ ВЕЛИЧИН',
				description:
					'Изучение различных алгоритмов сортировки и их эффективности',
				icon: '📊',
				lessons: 4,
				duration: '8 часов',
				path: '/courses/forschool/9/topic/2',
			},
			{
				id: 3,
				title: 'ОБРАБОТКА ИНФОРМАЦИИ В ЭЛЕКТРОННЫХ ТАБЛИЦАХ',
				description: 'Основы защиты информации и безопасной работы в интернете',
				icon: '📝',
				lessons: 6,
				duration: '10 часов',
				path: '/courses/forschool/9/topic/3',
			},
			{
				id: 4,
				title: 'КОМПЬЮТЕРНЫЕ ИНФОРМАЦИОННЫЕ МОДЕЛИ',
				description:
					'Объектно-ориентированное программирование на языке Python',
				icon: '🚀',
				lessons: 6,
				duration: '9 часов',
				path: '/courses/forschool/9/topic/4',
			},
		],
	},
}
