export const TopicsDataSixClass = {
	1: {
		title: 'ИНФОРМАЦИЯ И ИНФОРМАТИКА',
		description: `Понятие об информации и ее роли в обществе, о данных, об 
          информатике как науке.`,
		whatWeWillLearn: `
			Учащиеся соблюдают правила безопасной работы в компьютерном классе;
			умеют: правильно работать за компьютером; приводить примеры использования технических средств для работы с информацией.
		`,
		icon: '📊',
		lessons: [
			{
				id: 1,
				title: 'Информация и данные',
				icon: '📊',
				path: '/courses/forschool/6/topic/1/1',
			},
			{
				id: 2,
				title: 'Технические средства для работы с информацией',
				icon: '📊',
				path: '/courses/forschool/6/topic/1/2',
			},
		],
		color: 'red',
	},
	2: {
		title: 'ОСНОВЫ РАБОТЫ С КОМПЬЮТЕРОМ',
		description: `Узнаем о функциональных блоках компьютера и их назначении. А также узнаем много нового о ПК`,
		whatWeWillLearn: `
		Учащиеся
		знают возможности совместного использования цифровых устройств 
		и компьютера;
		умеют присваивать имена файлам и папкам;
		владеют: 
		навыками работы с мышью и клавиатурой; 
		приемами запуска программ и завершения их работы на компьютере.`,
		icon: '💻',
		lessons: [
			{
				id: 1,
				title: 'Структура компьютера',
				icon: '💻',
				path: '/courses/forschool/6/topic/2/1',
			},
			{
				id: 2,
				title: 'Компьютерные программы',
				icon: '💻',
				path: '/courses/forschool/6/topic/2/2',
			},
		],
		color: 'blue',
	},
	3: {
		title: 'ОБРАБОТКА РАСТРОВЫХ ИЗОБРАЖЕНИЙ',
		description: `Узнаем о растровых изображениях, их создании и редактировании, а также об операциях над фрагментами изображений`,
		whatWeWillLearn:`
			Учащиеся
			знают назначение и инструменты растрового графического 
			редактора;
			умеют: 
			создавать и редактировать изображения в растровом графическом
			редакторе; 
			использовать операции над фрагментами изображения в растровом 
			графическом редакторе; 
			сохранять изображение, открывать файл с изображением.
		`,
		icon: '🎨',
		lessons: [
			{
				id: 1,
				title: 'Растровые изображения',
				icon: '🎨',
				path: '/courses/forschool/6/topic/3/1',
			},
			{
				id: 2,
				title: 'Создание изображений',
				icon: '🎨',
				path: '/courses/forschool/6/topic/3/2',
			},
			{
				id: 3,
				title: 'Редактирование изображений',
				icon: '🎨',
				path: '/courses/forschool/6/topic/3/3',
			},
			{
				id: 4,
				title: 'Операции над фрагментом изображения',
				icon: '🎨',
				path: '/courses/forschool/6/topic/3/4',
			},
		],
		color: 'orangered',
	},
	4: {
		title: 'СОЗДАНИЕ ТЕКСТОВЫХ ДОКУМЕНТОВ',
		description: `Узнаем что такое текстовый документ, узнаем о назначении текстового редактора, узнаем про операции над текстом`,
		whatWeWillLearn:`
			Учащиеся
			знают:
			назначение текстового редактора;
			понятия символа и абзаца текста;
			умеют: 
			использовать текстовый редактор для ввода и редактирования 
			текста; 
			использовать средства форматирования текста; 
			открывать и сохранять текстовые файлы, готовить документ к 
			печати.
		`,
		icon: '📝',
		lessons: [
			{
				id: 1,
				title: 'Текстовый редактор',
				icon: '📝',
				path: '/courses/forschool/6/topic/4/1',
			},
			{
				id: 2,
				title: ' Редактирование текста',
				icon: '📝',
				path: '/courses/forschool/6/topic/4/2',
			},
			{
				id: 3,
				title: 'Форматирование текста',
				icon: '📝',
				path: '/courses/forschool/6/topic/4/3',
			},
		],
		color: 'gold',
	},
	5: {
		title: 'КОМПЬЮТЕРНЫЕ ПРЕЗЕНТАЦИИ',
		description: `Узнаем все о компьютерных презентациях и научимся создавать собственные, научимся работать с элементами мультимедии`,
		whatWeWillLearn:`
			Учащиеся
			знают возможности программы для работы с компьютерными 
			презентациями;
			умеют создавать, открывать, редактировать, сохранять и 
			демонстрировать презентацию с элементами мультимедиа.
		`,
		icon: '🎨',
		lessons: [
			{
				id: 1,
				title: 'Презентация',
				icon: '🎨',
				path: '/courses/forschool/6/topic/5/1',
			},
			{
				id: 2,
				title: 'Создание и редактирование презентации',
				icon: '🎨',
				path: '/courses/forschool/6/topic/5/2',
			},
			{
				id: 3,
				title: 'Элементы мультимедиа в презентации',
				icon: '🎨',
				path: '/courses/forschool/6/topic/5/3',
			},
			{
				id: 4,
				title: 'Настройка презентации',
				icon: '🎨',
				path: '/courses/forschool/6/topic/5/4',
			},
		],
		color: 'blueviolet',
	},
	7: {
		title: 'ИНТЕРНЕТ. ЭЛЕКТРОННАЯ ПОЧТА',
		description: `Узнаем о сети интернет, WWW(World Wide Web), научимся работать с электронной почтой и в сети интернет`,
		whatWeWillLearn:`
			Учащиеся
			знают: 
			назначение основных сервисов интернета; 
			назначение программ-браузеров; 
			структуру электронного письма;
			умеют: 
			просматривать веб-страницы; 
			использовать электронную почту для регистрации на веб-сайтах;
			владеют приемами создания, отправки, получения, сохранения, 
			пересылки электронных писем, прикрепления к электронным письмам 
			файлов.
		`,
		icon: '🌐',
		lessons: [
			{
				id: 1,
				title: 'Понятие сети Интернет. Сервисы сети Интернет',
				icon: '🌐',
				path: '/courses/forschool/6/topic/7/1',
			},
			{
				id: 2,
				title: 'Понятие об электронной почте',
				icon: '🌐',
				path: '/courses/forschool/6/topic/7/2',
			},
			{
				id: 3,
				title: ' Работа в сети Интернет',
				icon: '🌐',
				path: '/courses/forschool/6/topic/7/3',
			}
		],
		color: 'skyblue',
	},
}
